reddit/app/controllers/words_controller.rb

SELECT * FROM `words` ORDER BY weekfreq DESC LIMIT 50
---
  def index
    @plot = Cache.first()
    @wordtag = Word.first(:conditions => ["wid = ?", @plot.wid_id])

SELECT * FROM `words` WHERE (word = '--- \n- word\n- obama\n') LIMIT 1
---
  def create
      @wordtag = Word.first(:conditions => ["word = ?", params[:word][:word]])

SELECT * FROM `words` ORDER BY weekfreq DESC LIMIT 50
---
  def show
      @wordtag = Word.first(:conditions => ["word = ?", params[:id]])